MoonFox2006/CH32V003_MiniOscilloscope/src/main.c
//#define ADC_8BIT
#define USE_VREF
#define USE_SINUS

//#define USE_SH1106

#include <string.h>
#include <ch32v00x.h>
#ifdef USE_SPL
#include <ch32v00x_pwr.h>
#include <ch32v00x_rcc.h>
#include <ch32v00x_adc.h>
#include <ch32v00x_gpio.h>
#include <ch32v00x_tim.h>
#endif
#include "utils.h"
#include "twi.h"
#ifdef USE_SH1106
#include "sh1106.h"
#else
#include "ssd1306.h"
#endif
#include "encoder.h"

#define ARRAY_SIZE(a)   (sizeof(a) / sizeof(a[0]))

#define CHART_HEIGHT    55
#define CHART_TOP       (SCREEN_HEIGHT - CHART_HEIGHT)
#define CHART_LEFT      8

#define ADC_DATA_SIZE   120
#define ADC_TRIG_SIZE   (ADC_DATA_SIZE / 2)

#define ADC_FLAG_BUSY   1

enum { TRIG_FREE, TRIG_RISING, TRIG_FALLING };

const uint16_t PERIODS[] = {
    1, 2, 5, 10, 25, 50, 100, 250, 500, 1000, 2500, 5000, 10000
};

#define DEF_PERIOD  3 // 10 us.

#ifdef ADC_8BIT
static uint8_t adc_data[ADC_DATA_SIZE + ADC_TRIG_SIZE];
#else
static uint16_t adc_data[ADC_DATA_SIZE + ADC_TRIG_SIZE];
#endif
static char timestr[8];
static uint16_t vcc; // 500 or 330
#ifdef ADC_8BIT
static uint8_t vref; // ~1.2 V internal voltage reference
#else
static uint16_t vref; // ~1.2 V internal voltage reference
#endif
static volatile uint8_t _adc_flags;
//static volatile uint8_t adc_len = 0;
static uint8_t period = DEF_PERIOD;
static uint8_t trig = TRIG_RISING;
static uint8_t scale = 0;

static void Init_PVD() {
#ifdef USE_SPL
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);

    PWR_PVDLevelConfig(PWR_PVDLevel_4V4);
    PWR_PVDCmd(ENABLE);
#else
    RCC->APB1PCENR |= RCC_PWREN;
    RCC->APB2PCENR |= RCC_AFIOEN;

//    PWR->CTLR &= ~PWR_CTLR_PLS;
    PWR->CTLR |= (PWR_CTLR_PLS_0 | PWR_CTLR_PLS_1 | PWR_CTLR_PLS_2 | PWR_CTLR_PVDE);
#endif
}

#ifdef USE_SINUS
static void Init_Sinus(uint32_t freq) {
    const uint8_t SINUS[] = {
        63,  79,  93,  106, 116, 123, 126, 125, 120, 112, 100, 86,  71,  55,  40,  26,
        14,  6,   1,   0,   3,   10,  20,  33,  47
    };

#ifdef USE_SPL
    GPIO_InitTypeDef GPIO_InitStructure = { 0 };
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure = { 0 };
    TIM_OCInitTypeDef TIM_OCInitStructure = { 0 };
    DMA_InitTypeDef DMA_InitStructure = { 0 };

    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO | RCC_APB2Periph_TIM1 | RCC_APB2Periph_GPIOC, ENABLE);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_30MHz;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    GPIO_PinRemapConfig(GPIO_PartialRemap1_TIM1, ENABLE); // T1C3 = C0

    TIM_TimeBaseStructure.TIM_Period = 127; // 7 bit PWM
    TIM_TimeBaseStructure.TIM_Prescaler = (48000000 / 128) / (ARRAY_SIZE(SINUS) * freq) - 1;
    TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStructure);

    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
    TIM_OCInitStructure.TIM_Pulse = 0;
    TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
    TIM_OC3Init(TIM1, &TIM_OCInitStructure);

    TIM_OC3PreloadConfig(TIM1, TIM_OCPreload_Disable);
    TIM_ARRPreloadConfig(TIM1, ENABLE);

    DMA_DeInit(DMA1_Channel5);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&TIM1->CH3CVR;
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)SINUS;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
    DMA_InitStructure.DMA_BufferSize = ARRAY_SIZE(SINUS);
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
    DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(DMA1_Channel5, &DMA_InitStructure);

    DMA_Cmd(DMA1_Channel5, ENABLE);

    TIM_DMACmd(TIM1, TIM_DMA_Update, ENABLE);
    TIM_CtrlPWMOutputs(TIM1, ENABLE);
    TIM_Cmd(TIM1, ENABLE);
//    TIM_GenerateEvent(TIM1, TIM_EventSource_Update);
#else
    RCC->AHBPCENR |= RCC_DMA1EN;
    RCC->APB2PCENR |= (RCC_AFIOEN | RCC_TIM1EN | RCC_IOPCEN);

    UPDATE_REG32(&GPIOC->CFGLR, ~(0x0F << (0 * 4)), 0x0B << (0 * 4));

    UPDATE_REG32(&AFIO->PCFR1, ~AFIO_PCFR1_TIM1_REMAP, AFIO_PCFR1_TIM1_REMAP_0); // T1C3 = C0

    TIM1->CTLR1 = TIM_ARPE;
    TIM1->ATRLR = 127; // 7 bit PWM
    TIM1->PSC = (48000000 / 128) / (ARRAY_SIZE(SINUS) * freq) - 1;
    TIM1->RPTCR = 0;
    TIM1->SWEVGR = TIM_UG;

    UPDATE_REG16(&TIM1->CCER, ~(TIM_CC3E | TIM_CC3P | TIM_CC3NP | TIM_CC3NE), TIM_CC3E);
    UPDATE_REG16(&TIM1->CTLR2, ~(TIM_OIS3 | TIM_OIS3N), 0);
    UPDATE_REG16(&TIM1->CHCTLR2, ~(TIM_OC3M | TIM_CC3S | TIM_OC3PE), TIM_OC3M_1 | TIM_OC3M_2);
    TIM1->CH3CVR = 0;

    DMA1_Channel5->CFGR = DMA_CFGR1_DIR | DMA_CFGR1_MINC | DMA_CFGR1_PSIZE_0 | DMA_CFGR1_CIRC | DMA_CFGR1_PL_0 | DMA_CFGR1_PL_1;
    DMA1_Channel5->CNTR = ARRAY_SIZE(SINUS);
    DMA1_Channel5->PADDR = (uint32_t)&TIM1->CH3CVR;
    DMA1_Channel5->MADDR = (uint32_t)SINUS;
    DMA1_Channel5->CFGR |= DMA_CFGR1_EN;

    TIM1->DMAINTENR |= TIM_UDE;
    TIM1->BDTR |= TIM_MOE;
    TIM1->CTLR1 |= TIM_CEN;
//    TIM1->SWEVGR = TIM_UG;
#endif
}
#endif

static void Init_ADC(uint16_t us) {
#ifdef USE_SPL
    GPIO_InitTypeDef GPIO_InitStructure = { 0 };
    ADC_InitTypeDef  ADC_InitStructure = { 0 };
    DMA_InitTypeDef DMA_InitStructure = { 0 };
    NVIC_InitTypeDef NVIC_InitStructure = { 0 };

    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
    TIM_OCInitTypeDef TIM_OCInitStructure;

    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1 | RCC_APB2Periph_GPIOC, ENABLE);
    RCC_ADCCLKConfig(RCC_PCLK2_Div2); // 24 MHz
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    ADC_DeInit(ADC1);
    ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
    ADC_InitStructure.ADC_ScanConvMode = DISABLE;
    ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_NbrOfChannel = 1;
    ADC_Init(ADC1, &ADC_InitStructure);

    ADC_Calibration_Vol(ADC1, ADC_CALVOL_50PERCENT);
    ADC_Cmd(ADC1, ENABLE);

    ADC_ResetCalibration(ADC1);
    while(ADC_GetResetCalibrationStatus(ADC1)) {}
    ADC_StartCalibration(ADC1);
    while(ADC_GetCalibrationStatus(ADC1)) {}

