MoonFox2006/CH32V003_MiniOscilloscope/src/main.c
    ADC_RegularChannelConfig(ADC1, ADC_Channel_Vrefint, 1, ADC_SampleTime_241Cycles);

    {
        uint32_t sum = 0;

        for (uint8_t i = 0; i <= 10; ++i) {
            ADC_SoftwareStartConvCmd(ADC1, ENABLE);
            while (! ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC)) {}
            if (i) { // Skip first value
                sum += ADC_GetConversionValue(ADC1);
            }
        }
#ifdef ADC_8BIT
        vref = (sum / 10) >> 2;
#else
        vref = sum / 10;
#endif
    }

    ADC_Cmd(ADC1, DISABLE);

    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T2_CC1;
#ifdef ADC_8BIT
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Left;
#endif
    ADC_Init(ADC1, &ADC_InitStructure);

    ADC_RegularChannelConfig(ADC1, ADC_Channel_2, 1, us > 10 ? ADC_SampleTime_241Cycles : us > 3 ? ADC_SampleTime_73Cycles : us > 2 ? ADC_SampleTime_57Cycles : us > 1 ? ADC_SampleTime_30Cycles : ADC_SampleTime_9Cycles);
    ADC_ExternalTrig_DLY(ADC1, ADC_ExternalTrigRegul_DLY, 0);
    ADC_ExternalTrigConvCmd(ADC1, ENABLE);

    ADC_Cmd(ADC1, ENABLE);
    ADC_DMACmd(ADC1, ENABLE);

    DMA_DeInit(DMA1_Channel1);
#ifdef ADC_8BIT
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&ADC1->RDATAR + 1;
#else
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&ADC1->RDATAR;
#endif
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)adc_data;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
    DMA_InitStructure.DMA_BufferSize = (trig == TRIG_FREE) ? ADC_DATA_SIZE : ARRAY_SIZE(adc_data);
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
#ifdef ADC_8BIT
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
#else
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
#endif
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
    DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(DMA1_Channel1, &DMA_InitStructure);

    NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel1_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    DMA_ITConfig(DMA1_Channel1, DMA_IT_TC, ENABLE);
/*
    NVIC_InitStructure.NVIC_IRQChannel = ADC_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    ADC_ITConfig(ADC1, ADC_IT_EOC, ENABLE);
*/

    TIM_TimeBaseStructInit(&TIM_TimeBaseInitStructure);
    TIM_TimeBaseInitStructure.TIM_Prescaler = (us > 1 ? 48 : 24) - 1; // 0.5/1 us.
    TIM_TimeBaseInitStructure.TIM_Period = (us > 1 ? us : 2) - 1;
    TIM_TimeBaseInit(TIM2, &TIM_TimeBaseInitStructure);

    TIM_OCStructInit(&TIM_OCInitStructure);
    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
    TIM_OCInitStructure.TIM_Pulse = (us > 1 ? us : 2) - 1;
    TIM_OC1Init(TIM2, &TIM_OCInitStructure);

    TIM_CtrlPWMOutputs(TIM2, ENABLE);
    TIM_OC1PreloadConfig(TIM2, TIM_OCPreload_Disable);
    TIM_ARRPreloadConfig(TIM2, ENABLE);
//    TIM_Cmd(TIM2, ENABLE);
#else
    RCC->APB1PCENR |= RCC_TIM2EN;
    RCC->APB2PCENR |= (RCC_ADC1EN | RCC_IOPCEN);
    RCC->AHBPCENR |= RCC_DMA1EN;

    UPDATE_REG32(&RCC->CFGR0, 0xFFFF07FF, 0); // CFGR0_ADCPRE_Reset_Mask, 24 MHz

    UPDATE_REG32(&GPIOC->CFGLR, ~(0x0F << (4 * 4)), 0x00 << (4 * 4));

    RCC->APB2PRSTR |= RCC_ADC1RST;
    RCC->APB2PRSTR &= ~RCC_ADC1RST;

    UPDATE_REG32(&ADC1->CTLR1, 0xFFF0FEFF, 0 | (0 << 8)); // CTLR1_CLEAR_Mask
    UPDATE_REG32(&ADC1->CTLR2, 0xFFF1F7FD, (ADC_EXTSEL_0 | ADC_EXTSEL_1 | ADC_EXTSEL_2) | (0 << 1) | ADC_EXTTRIG); // CTLR2_CLEAR_Mask
    UPDATE_REG32(&ADC1->RSQR1, 0xFF0FFFFF, (1 - 1) << 20); // RSQR1_CLEAR_Mask
    UPDATE_REG32(&ADC1->SAMPTR2, ~(0x07 << (3 * 2)), 0x07 << (3 * 2));

    UPDATE_REG32(&ADC1->CTLR1, ~(uint32_t)(3 << 25), ADC_CALVOLSELECT_0);
    ADC1->CTLR2 |= ADC_ADON;

    ADC1->CTLR2 |= ADC_RSTCAL;
    while (ADC1->CTLR2 & ADC_RSTCAL) {}
    ADC1->CTLR2 |= ADC_CAL;
    while (ADC1->CTLR2 & ADC_CAL) {}

    UPDATE_REG32(&ADC1->RSQR3, ~(0x1F << (5 * 0)), (uint32_t)8 << (5 * 0)); // ADC_Channel_Vrefint (8)

    {
        uint32_t sum = 0;

        for (uint8_t i = 0; i <= 10; ++i) {
            ADC1->CTLR2 |= ADC_SWSTART;
            while (! (ADC1->STATR & ADC_EOC)) {}
            if (i) { // Skip first value
                sum += ADC1->RDATAR;
            }
        }
#ifdef ADC_8BIT
        vref = (sum / 10) >> 2;
#else
        vref = sum / 10;
#endif
    }

    ADC1->CTLR2 &= ~ADC_ADON;

#ifdef ADC_8BIT
    UPDATE_REG32(&ADC1->CTLR2, 0xFFF1F7FD, ADC_ALIGN | ADC_EXTSEL_2 | (0 << 1) | ADC_EXTTRIG); // CTLR2_CLEAR_Mask
#else
    UPDATE_REG32(&ADC1->CTLR2, 0xFFF1F7FD, ADC_EXTSEL_2 | (0 << 1) | ADC_EXTTRIG); // CTLR2_CLEAR_Mask
#endif
//    UPDATE_REG32(&ADC1->RSQR1, 0xFF0FFFFF, (1 - 1) << 20); // RSQR1_CLEAR_Mask
    UPDATE_REG32(&ADC1->SAMPTR2, ~(0x07 << (3 * 2)),
        (uint32_t)(us > 10 ? 0x07 : us > 3 ? 0x06 : us > 2 ? 0x05 : us > 1 ? 0x03 : 0x01) << (3 * 2));
    UPDATE_REG32(&ADC1->RSQR3, ~(0x1F << (5 * 0)), (uint32_t)2 << (5 * 0));
    ADC1->DLYR &= ~(uint32_t)0x03FF;

    ADC1->CTLR2 |= (ADC_ADON | ADC_DMA);

#ifdef ADC_8BIT
    DMA1_Channel1->CFGR = DMA_CFGR1_MINC | DMA_CFGR1_PL_0 | DMA_CFGR1_PL_1;
#else
    DMA1_Channel1->CFGR = DMA_CFGR1_MINC | DMA_CFGR1_PSIZE_0 | DMA_CFGR1_MSIZE_0 | DMA_CFGR1_PL_0 | DMA_CFGR1_PL_1;
#endif
    DMA1_Channel1->CNTR = (trig == TRIG_FREE) ? ADC_DATA_SIZE : ARRAY_SIZE(adc_data);
#ifdef ADC_8BIT
    DMA1_Channel1->PADDR = (uint32_t)&ADC1->RDATAR + 1;
#else
    DMA1_Channel1->PADDR = (uint32_t)&ADC1->RDATAR;
#endif
    DMA1_Channel1->MADDR = (uint32_t)adc_data;

    NVIC_SetPriority(DMA1_Channel1_IRQn, (0 << 7) | (1 << 6));
    NVIC_EnableIRQ(DMA1_Channel1_IRQn);

