MoonFox2006/CH32V003_MiniOscilloscope/src/main.c
    DMA1_Channel1->CFGR |= DMA_CFGR1_TCIE;
/*
    NVIC_SetPriority(ADC_IRQn, (0 << 7) | (1 << 6));
    NVIC_EnableIRQ(ADC_IRQn);

    ADC1->CTLR1 |= ADC_EOCIE;
*/

    TIM2->CTLR1 = TIM_ARPE;
    TIM2->ATRLR = (us > 1 ? us : 2) - 1;
    TIM2->PSC = (us > 1 ? 48 : 24) - 1; // 0.5/1 us.
    TIM2->SWEVGR = TIM_UG;

    UPDATE_REG16(&TIM2->CCER, ~(TIM_CC1E | TIM_CC1P), TIM_CC1E);
    UPDATE_REG16(&TIM2->CHCTLR1, ~(TIM_OC1M | TIM_CC1S | TIM_OC1PE), TIM_OC1M_1 | TIM_OC1M_2);
    TIM2->CH1CVR = (us > 1 ? us : 2) - 1;

    TIM2->BDTR |= TIM_MOE;
//    TIM2->CTLR1 |= TIM_CEN;
#endif
}

static void Reinit_ADC(uint16_t us) {
#ifdef USE_SPL
    TIM_Cmd(TIM2, DISABLE);
    DMA_Cmd(DMA1_Channel1, DISABLE);
    ADC_Cmd(ADC1, DISABLE);

    ADC_RegularChannelConfig(ADC1, ADC_Channel_2, 1, us > 10 ? ADC_SampleTime_241Cycles : us > 3 ? ADC_SampleTime_73Cycles : us > 2 ? ADC_SampleTime_57Cycles : us > 1 ? ADC_SampleTime_30Cycles : ADC_SampleTime_9Cycles);

    ADC_Cmd(ADC1, ENABLE);

/*
#ifdef ADC_8BIT
    if (scale && (us > 10)) { // 8 low bits
        ADC1->CTLR2 &= ~ADC_ALIGN;
        DMA1_Channel1->PADDR = (uint32_t)&ADC1->RDATAR;
    } else { // 8 high bits
        ADC1->CTLR2 |= ADC_ALIGN;
        DMA1_Channel1->PADDR = (uint32_t)&ADC1->RDATAR + 1;
    }
#endif
*/

    TIM_SetAutoreload(TIM2, (us > 1 ? us : 2) - 1);
    TIM_PrescalerConfig(TIM2, (us > 1 ? 48 : 24) - 1, TIM_PSCReloadMode_Immediate); // 0.5/1 us.

    TIM_SetCompare1(TIM2, (us > 1 ? us : 2) - 1);
#else
    TIM2->CTLR1 &= ~TIM_CEN;
    DMA1_Channel1->CFGR &= ~(uint32_t)DMA_CFGR1_EN;
    ADC1->CTLR2 &= ~ADC_ADON;

/*
#ifdef ADC_8BIT
    if (scale && (us > 10)) { // 8 low bits
        ADC1->CTLR2 &= ~ADC_ALIGN;
        DMA1_Channel1->PADDR = (uint32_t)&ADC1->RDATAR;
    } else { // 8 high bits
        ADC1->CTLR2 |= ADC_ALIGN;
        DMA1_Channel1->PADDR = (uint32_t)&ADC1->RDATAR + 1;
    }
#endif
*/

    UPDATE_REG32(&ADC1->SAMPTR2, ~(0x07 << (3 * 2)),
        (uint32_t)(us > 10 ? 0x07 : us > 3 ? 0x06 : us > 2 ? 0x05 : us > 1 ? 0x03 : 0x01) << (3 * 2));
    UPDATE_REG32(&ADC1->RSQR3, ~(0x1F << (5 * 0)), (uint32_t)2 << (5 * 0));

    ADC1->CTLR2 |= ADC_ADON;

    TIM2->ATRLR = (us > 1 ? us : 2) - 1;
    TIM2->PSC = (us > 1 ? 48 : 24) - 1; // 0.5/1 us.
    TIM2->SWEVGR = TIM_UG;

    TIM2->CH1CVR = (us > 1 ? us : 2) - 1;
#endif
}

static void Start_ADC(bool wait) {
    DMA1_Channel1->MADDR = (uint32_t)adc_data;
#ifdef USE_SPL
    DMA_SetCurrDataCounter(DMA1_Channel1, (trig == TRIG_FREE) ? ADC_DATA_SIZE : ARRAY_SIZE(adc_data));
    DMA_Cmd(DMA1_Channel1, ENABLE);

    TIM_SetCounter(TIM2, 0);
//    ADC_ExternalTrigConvCmd(ADC1, ENABLE);
//    adc_len = 0;
    _adc_flags = ADC_FLAG_BUSY;
    TIM_Cmd(TIM2, ENABLE);
#else
    DMA1_Channel1->CNTR = (trig == TRIG_FREE) ? ADC_DATA_SIZE : ARRAY_SIZE(adc_data);
    DMA1_Channel1->CFGR |= DMA_CFGR1_EN;

    TIM2->CNT = 0;
//    ADC1->CTLR2 |= ADC_EXTTRIG;
//    adc_len = 0;
    _adc_flags = ADC_FLAG_BUSY;
    TIM2->CTLR1 |= TIM_CEN;
#endif
    if (wait) {
//        while (adc_len < ADC_DATA_SIZE) {}
        while (_adc_flags & ADC_FLAG_BUSY) {}
    }
}

static char *u2str(char *s, uint16_t value, uint16_t dec) {
    uint16_t divider;

    for (divider = 10000; divider > dec; divider /= 10) {
        if (value / divider)
            break;
    }
    for (; divider > 0; divider /= 10) {
        *s++ = '0' + value / divider;
        value %= divider;
    }
    *s = '\0';
    return s;
}

static void norm_time(uint32_t period) {
    char *s;

    period *= (ADC_DATA_SIZE >> 2);
    if (period < 1000) {
//        sprintf(timestr, "%uu", period);
        s = u2str(timestr, period, 1);
        *s++ = 'u';
    } else {
        if ((period % 1000) == 0) {
//            sprintf(timestr, "%um", period / 1000);
            s = u2str(timestr, period / 1000, 1);
        } else {
//            sprintf(timestr, "%u.%um", period / 1000, (period % 1000) / 100);
            s = u2str(timestr, period / 1000, 1);
            *s++ = '.';
            s = u2str(s, (period % 1000) / 100, 1);
        }
        *s++ = 'm';
    }
    *s = '\0';
}

static inline uint16_t trim(uint16_t data) {
#ifdef ADC_8BIT
    return (data > 255) ? 255 : data & 0xFF;
#else
    return (data > 1023) ? 1023 : data & 0x3FF;
#endif
}

static void find_range(uint16_t *min_value, uint16_t *max_value, uint8_t start, uint8_t size) {
    *min_value = adc_data[start];
    *max_value = adc_data[start];
    ++start;

    while (--size) {
        if (adc_data[start] < *min_value)
            *min_value = adc_data[start];
        if (adc_data[start] > *max_value)
            *max_value = adc_data[start];
        ++start;
    }
}

static void draw_screen(bool plot, bool wait) {
    char str[22];
    char *s;
    uint16_t adc_min, adc_max;
#ifdef ADC_8BIT
    uint8_t trig_value;
#else
    uint16_t trig_value;
#endif
    uint8_t trig_start = 0;

    screen_clear();
    screen_vline(CHART_LEFT - 1, CHART_TOP, CHART_HEIGHT, 1);
    if (vcc == 500) { // 5.0 V
        for (uint8_t y = 5 + CHART_TOP; y < SCREEN_HEIGHT; y += 11) {
            for (uint8_t x = 4; x < SCREEN_WIDTH; x += 8) {
                screen_hline(x, y, 3, 1);
            }
        }
    } else { // 3.3 V
        for (uint8_t y = 10 + CHART_TOP; y < SCREEN_HEIGHT; y += 17) {
            for (uint8_t x = 4; x < SCREEN_WIDTH; x += 8) {
                screen_hline(x, y, 3, 1);
            }
        }
    }
    for (uint8_t x = CHART_LEFT + 30; x < SCREEN_WIDTH; x += 30) {
        for (uint8_t y = CHART_TOP + 2; y < SCREEN_HEIGHT; y += 8) {
            screen_vline(x, y, 3, 1);
        }
    }

    if (trig != TRIG_FREE) {
        find_range(&adc_min, &adc_max, 0, ADC_TRIG_SIZE);
        trig_value = (adc_max - adc_min + 1) >> 1; // /2
        while (trig_start < ADC_TRIG_SIZE) {
            if (trig == TRIG_RISING) {
                if ((adc_data[trig_start] < trig_value) && (adc_data[trig_start + 1] >= trig_value))
                    break;
            } else { // trig == TRIG_FALLING
                if ((adc_data[trig_start] > trig_value) && (adc_data[trig_start + 1] <= trig_value))
                    break;
            }
            ++trig_start;
        }
    }
    find_range(&adc_min, &adc_max, trig_start, ADC_DATA_SIZE);
#ifdef ADC_8BIT
    if ((adc_max - adc_min) << scale >= 255)
        trig_value = 0;
    else
        trig_value = (255 - ((adc_max - adc_min) << scale)) >> 1;
#else
    if ((adc_max - adc_min) << scale >= 1023)
        trig_value = 0;
    else
        trig_value = (1023 - ((adc_max - adc_min) << scale)) >> 1;
#endif
    for (uint8_t i = 0; i < ADC_DATA_SIZE; ++i) {
        uint8_t index = i + trig_start;

#ifdef ADC_8BIT
        adc_data[index] = SCREEN_HEIGHT - 1 - trim(((adc_data[index] - adc_min) << scale) + trig_value) * CHART_HEIGHT / 255;
#else
        adc_data[index] = SCREEN_HEIGHT - 1 - trim(((adc_data[index] - adc_min) << scale) + trig_value) * CHART_HEIGHT / 1023;
#endif
        if (plot) {
            screen_pixel(i + CHART_LEFT, adc_data[index], 1);
        } else {
            if (i)
                screen_line(i + CHART_LEFT - 1, adc_data[index - 1], i + CHART_LEFT, adc_data[index], 1);
        }
    }
#ifdef USE_VREF
    adc_min = adc_min * 120 / vref;
    adc_max = adc_max * 120 / vref;
#else
#ifdef ADC_8BIT
    adc_min = adc_min * vcc / 255;
    adc_max = adc_max * vcc / 255;
#else
    adc_min = adc_min * vcc / 1023;
    adc_max = adc_max * vcc / 1023;
#endif
#endif
    str[0] = (trig == TRIG_RISING) ? '/' : (trig == TRIG_FALLING) ? '\\' : '~';
    str[1] = ' ';
    str[2] = 'x';
    str[3] = '0' + (1 << scale);
    str[4] = ' ';
    strcpy(&str[5], timestr);
//    sprintf(&str[strlen(str)], "s %u.%02u-%u.%02u", adc_min / 100, adc_min % 100, adc_max / 100, adc_max % 100);
    s = &str[strlen(str)];
    *s++ = 's';
    *s++ = ' ';
    s = u2str(s, adc_min / 100, 1);
    *s++ = '.';
    s = u2str(s, adc_min % 100, 10);
    *s++ = '-';
    s = u2str(s, adc_max / 100, 1);
    *s++ = '.';
    s = u2str(s, adc_max % 100, 10);
    *s = '\0';
    screen_printstr(str, 0, 0, 1);
#ifdef USE_SH1106
    sh1106_flush(wait);
#else
    ssd1306_flush(wait);
#endif
}

int main(void) {
    Init_PVD();

    TWI_Init(400000);

    Encoder_Init(); // To prevent phantom button click, initialize before delay

