MoonFox2006/CH32V003_MiniOscilloscope/src/main.c
    delay_ms(50);

#ifdef USE_SH1106
    if (! sh1106_begin()) {
#else
    if (! ssd1306_begin()) {
#endif
        while (1) {}
    }

    Init_ADC(PERIODS[period]);

#ifdef USE_SINUS
    Init_Sinus(1000);
#endif

    Start_ADC(false);

    norm_time(PERIODS[period]);

#ifdef USE_SPL
    if (PWR_GetFlagStatus(PWR_FLAG_PVDO)) // Below 4.4 V
#else
    if (PWR->CSR & PWR_CSR_PVDO) // Below 4.4 V
#endif
        vcc = 330; // 3.3 V
    else
        vcc = 500; // 5.0 V

    while(1) {
        int8_t e;

        e = Encoder_Read();
        if (e != 0) {
            if (Encoder_Button()) { // Trigger mode or scale
                if (e < 0) { // Trigger mode
                    if (trig < TRIG_FALLING)
                        ++trig;
                    else
                        trig = TRIG_FREE;
                } else { // Scale
                    if (scale < 2) // x4
                        ++scale;
                    else
                        scale = 0;
                }
            } else { // Period
                if (e < 0) {
                    if (period > 0)
                        --period;
                    else
                        period = ARRAY_SIZE(PERIODS) - 1;
                } else {
                    if (period < ARRAY_SIZE(PERIODS) - 1)
                        ++period;
                    else
                        period = 0;
                }
                norm_time(PERIODS[period]);
            }

            Reinit_ADC(PERIODS[period]);
            Start_ADC(false);
        }

        if (! (_adc_flags & ADC_FLAG_BUSY)) {
            draw_screen(false, PERIODS[period] <= 100);
            Start_ADC(false);
        }
    }
}

void __attribute__((interrupt("WCH-Interrupt-fast"))) DMA1_Channel1_IRQHandler() {
#ifdef USE_SPL
    if (DMA_GetITStatus(DMA1_IT_TC1)) {
        TIM_Cmd(TIM2, DISABLE);
        DMA_Cmd(DMA1_Channel1, DISABLE);
        DMA_ClearITPendingBit(DMA1_IT_TC1);
        _adc_flags = 0;
    }
#else
    if (DMA1->INTFR & DMA_TCIF1) {
        TIM2->CTLR1 &= ~TIM_CEN;
        DMA1_Channel1->CFGR &= ~(uint32_t)DMA_CFGR1_EN;
        DMA1->INTFCR = DMA_CTCIF1;
        _adc_flags = 0;
    }
#endif
}

/*
void __attribute__((interrupt("WCH-Interrupt-fast"))) ADC1_IRQHandler() {
#ifdef USE_SPL
    if (ADC_GetITStatus(ADC1, ADC_IT_EOC)) {
#ifdef ADC_8BIT
        adc_data[adc_len] = ADC_GetConversionValue(ADC1) >> 8;
#else
        adc_data[adc_len] = ADC_GetConversionValue(ADC1);
#endif
        if (++adc_len >= ADC_DATA_SIZE) {
//            ADC_ExternalTrigConvCmd(ADC1, DISABLE);
            TIM_Cmd(TIM2, DISABLE);
        }
        ADC_ClearITPendingBit(ADC1, ADC_IT_EOC);
    }
#else
    if (ADC1->STATR & ADC_EOC) {
#ifdef ADC_8BIT
        adc_data[adc_len] = ADC1->RDATAR >> 8;
#else
        adc_data[adc_len] = ADC1->RDATAR;
#endif
        if (++adc_len >= ADC_DATA_SIZE) {
//            ADC1->CTLR2 &= 0xFFEFFFFF; // CTLR2_EXTTRIG_Reset
            TIM2->CTLR1 &= ~TIM_CEN;
        }
        ADC1->STATR = ~(uint32_t)ADC_EOC;
    }
#endif
}
*/
